/**
*任务02_1打印机器人
*孟菲菲
*680
*8班
*2017 03.18
*/
#include<stdio.h>

    int main(void)
{
	printf("          ******\n");
	printf("          ******\n");
	printf("          ******\n");
	printf("*****************************\n");
	printf("*****************************\n");
	printf("      ***************\n");
	printf("      ***************\n");
	printf("      ***************\n");
	printf("      ***************\n");
	printf("        ****   ****\n");
	printf("        ****   ****\n");
	printf("        ****   ****\n");
	printf("        ****   ****\n");
	printf("        ****   ****\n");
	return 0;
}