#include<stdio.h>
#include<stdlib.h>

   int main(void)
{
      int x=34,y=-34;
	  printf("x=%8d,y=%8d\n",x,y);//宽度8位，符号保留
	  printf("x=%08d,y=%08d\n",x,y);//宽度8位，除去数字所占得位数，其余用零补足，符号保留
	  printf("x=% 8d,y=% 8d\n",x,y);//宽度8位，除去数字所占的位数，其余用空格补足，符号正数用空格，负数用负号
	  printf("x=%+8d,y=%+8d\n",x,y);//宽度8位，除去数字所占的位数，其余用空格补足，符号正数用正号，负数用负号
	  printf("x=%- 8d,y=%- 8d\n",x,y);//宽度8位，数字左对齐，负号保留，其余用空格表示
	  printf("x=%-+8d,y=%-+8d\n",x,y);//宽度8位，数字左对齐，负号正数用正号，负数用负号，其余用空格表示
	  printf("x=%8.4d,y=%8.4d\n",x,y);//宽度8位，精度4，要在数字前加00，符号保留
	  printf("x=%-8.4d,y=%-8.4d\n",x,y);//宽度8位，精度4，要在数字前加00，数字左对齐，符号保留
	  return 0;
}